# include <stdio.h>
# include <windows.h>

int main() {
	////1,求两个数字的最大公约数，辗转相除法。
	////先读取两个整形数字
	//int a;
	//int b;
	//printf("请输入两个整形数字：\n");
	//scanf_s("%d %d \n", &a, &b);
	////下边是具体函数
	//int t;
	//while (a % b != 0){
	//	t = a % b;//表示余数
	//	a = b;//被除数赋值给除数
	//	b = t;//余数赋值给除数
	//}
	////上边走完后余数一定是0，所以输出最后的除数b,就是最大公约数。
	//printf("最大公约数是： %d", b);
	////2,打印1000~2000内的所有闰年。
	////闰年的定义：能被4整除并且不能被100整除||能被400整除。
	/*int year = 0;
	printf("1000到2000年内的所有闰年如下：\n");
	for (int year = 1000; year <= 2000; year++){
	if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0)
	printf("%d  ", year);
	}
	printf("\n");*/
	//3，打印100~200之间的所有的素数
	//思路：素数定义就是只能被1和自己整除。
	//int i;
	//int j;
	//printf("100~200内的所有的素数如下： \n");
	//for (i = 100; i <= 200; i++){
	//	for (j = 2; j < i; j++){
	//		if (i % j == 0)
	//			break;
	//	}
	//	if (j == i){//找到了素数，进行打印
	//		printf("%d  ", i);
	//	}
	//}
	//printf("\n");
	////4,编写从1~100数字中的所有整数中出现了多少个9.
	////一是十位出现9.二是个位出现9.三是十位个位都出现9.
	//int i;
	//int count = 0;
	//for (int i = 1; i <= 100; i++){
	//	if (i % 10 == 9){//判断的是个位是否是9.
	//		count++;
	//	}
	//	if (i / 10 == 9){//判断十位是否是9.
	//		count ++;
	//	}
	//}
	//printf("1~100之间出现的9的个数是：%d \n", count);
	//5,求1-1/2+1/3-1/4+1/5+ ......-1/100的最重的结果。
	//分母进行自增，分子和（-1）的次方有关,出现了分数，
	//尽量一定要用double来进行变量的定义。
	//double i;
	//double sum = 0;
	//double flag = 1;
	//for (double i = 1; i <= 100; i++){
	//	sum += flag / i;
	//	flag = -flag;//更新的是flag的值，依次取反即可。
	//}
	//printf("最终的结果是：%f", sum);//浮点数用%f来打印的，不是%d。
	///*double sum = 0;
	//for (int i = 1; i <= 100; i++){
	//	sum += ((-1) ^ (i + 1)) / i;
	//}
	//printf("最终的结果是：%f", sum);*/
	//6,求10个整数中的最大值。
	//	int arr[9];
	//	int i = 0;
	//	printf("请输入10个整数\n");
	//	//从键盘上读取10个数字。
	//	for (int i = 0; i < 10; i++){
	//		scanf_s("%d", &arr[i]);
	//	}
	//	for (int i = 1; i < 10; i++){
	//		if (arr[0] < arr[i]){
	//			arr[0] = arr[i];
	//		}
	//	}
	//	printf("最大的数是： %d\n", arr[i]);
	printf("\n");
	system("pause");
	return 0;
}